ProgessBase/InformationRegisters/Вет_ДвижениеПоПартиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Вет_ДвижениеПоПартиям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Вет_ВидДвиженияПартии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Вет_Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вет_Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Enums/Вет_ТипПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>Вет_ТипПартии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Производственная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Складская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Enums/Вет_ВидДвиженияПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>Вет_ВидДвиженияПартии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачальныйОстаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаНачальногоОстатка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оприходование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаОприходования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Catalogs/Вет_Партии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Вет_Партии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Вет_ТипПартии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/CommonModules/Вет_УправлениеЛокальнымиПартиями/Ext/Module.bsl
Функция СоздатьЛокальнуюПартию(Документ1С, СтрокаПеречня) Экспорт
	
	НовыйЭлемент = Справочники.Вет_Партии.СоздатьЭлемент();
	НовыйЭлемент.ТипПартии = Перечисления.Вет_ТипПартии.Складская;
	НовыйЭлемент.Документ1С = Документ1С;
	НовыйЭлемент.Номенклатура = СтрокаПеречня.Номенклатура;
	НовыйЭлемент.ЕдиницаИзмерения = СтрокаПеречня.ЕдиницаИзмерения;
	НовыйЭлемент.Записать();
	
	ЭлементСсылка = НовыйЭлемент.Ссылка;
	ДобавитьДвижениеПоПартии(ЭлементСсылка, СтрокаПеречня.Количество);	
	
	Возврат ЭлементСсылка;
	
КонецФункции

Процедура ДобавитьДвижениеПоПартии(Партия, Количество) Экспорт
	
	// TO DO Решить проблему с паралелльным доступом из двух мест 
	МенеджерЗаписи = РегистрыСведений.Вет_ДвижениеПоПартиям.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Вет_Партия = Партия;
	МенеджерЗаписи.ПорядковыйНомер = КоличествоДвиженийПоПартии(Партия) + 1;
	МенеджерЗаписи.Количество = Количество;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Функция КоличествоДвиженийПоПартии(Партия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(Вет_ДвижениеПоПартиям.ПорядковыйНомер) КАК ПорядковыйНомер
		|ИЗ
		|	РегистрСведений.Вет_ДвижениеПоПартиям КАК Вет_ДвижениеПоПартиям
		|ГДЕ
		|	Вет_ДвижениеПоПартиям.Вет_Партия = &Партия";
	
	Запрос.УстановитьПараметр("Партия", Партия);
	РезультатЗапроса = Запрос.Выполнить();
	РезультатТаблица = РезультатЗапроса.Выгрузить();
	
	Возврат ?(РезультатТаблица.ПорядковыйНомер = неопределено, 0, РезультатТаблица.ПорядковыйНомер);
	
КонецФункции

Функция ОстатокПартии(Партия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Вет_ДвижениеПоПартиям.Вет_Партия КАК Партия,
		|	СУММА(Вет_ДвижениеПоПартиям.Количество) КАК Остаток
		|ИЗ
		|	РегистрСведений.Вет_ДвижениеПоПартиям КАК Вет_ДвижениеПоПартиям
		|ГДЕ
		|	Вет_ДвижениеПоПартиям.Вет_Партия = &Вет_Партия
		|
		|СГРУППИРОВАТЬ ПО
		|	Вет_ДвижениеПоПартиям.Вет_Партия";
	
	Запрос.УстановитьПараметр("Вет_Партия", Партия);
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	Возврат Выгрузка.Остаток;
	
КонецФункции

Функция ПартииПоДокументу(Документ1С) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Вет_Партии.Ссылка КАК Ссылка,
		|	Вет_Партии.Номенклатура КАК Номенклатура,
		|	Вет_Партии.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.Вет_Партии КАК Вет_Партии
		|ГДЕ
		|	Вет_Партии.Документ1С = &Документ1С";
	
	Запрос.УстановитьПараметр("Документ1С", Документ1С);
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции

Функция РазностьМеждуДокументомИНачальнымиЗначениямиПартий(Документ1С, Документ1СКорр=Неопределено) Экспорт
	
	Если Документ1СКорр = Неопределено Тогда
		Документ1СКорр = Документ1С;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Срез.Номенклатура,
		|	Срез.ЕдиницаИзмерения,
		|	СУММА(Срез.НачальныйОстаток) КАК Разность
		|
		|ИЗ (
		|	ВЫБРАТЬ
		|		Партии.Номенклатура КАК Номенклатура,
		|		Партии.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		СУММА(ДвижениеПоПартиям.Количество) КАК НачальныйОстаток
		|	ИЗ
		|		Справочник.Вет_Партии КАК Партии
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Вет_ДвижениеПоПартиям КАК ДвижениеПоПартиям
		|			ПО (ДвижениеПоПартиям.Вет_Партия = Партии.Ссылка)
		|	ГДЕ
		|		Партии.Документ1С = &Документ1С
		|		И ДвижениеПоПартиям.ВидДвижения В (
		|				ЗНАЧЕНИЕ(Перечисление.Вет_ВидДвиженияПартии.НачальныйОстаток), 
		|				ЗНАЧЕНИЕ(Перечисление.Вет_ВидДвиженияПартии.КорректировкаНачальногоОстатка))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Партии.Номенклатура,
		|		Партии.ЕдиницаИзмерения
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ТЧТовары.Номенклатура,
		|		ТЧТовары.ЕдиницаИзмерения,
		|		- СУММА(ТЧТовары.Количество) КАК НачальныйОстаток
		|	ИЗ
		|		Документ.ПоступлениеТоваровУслуг.Товары КАК ТЧТовары
		|	ГДЕ
		|		ТЧТовары.Ссылка = &Документ1СКорр
		|
		|	СГРУППИРОВАТЬ ПО
		|		ТЧТовары.Номенклатура,
		|		ТЧТовары.ЕдиницаИзмерения 
		|) КАК Срез
		|
		|СГРУППИРОВАТЬ ПО
		|	Срез.Номенклатура,
		|	Срез.ЕдиницаИзмерения
		|
		|ИМЕЮЩИЕ
		|	СУММА(Срез.НачальныйОстаток) <> 0";
	
	Запрос.УстановитьПараметр("Документ1С", 		Документ1С);
	Запрос.УстановитьПараметр("Документ1СКорр", 	Документ1СКорр);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции
